INSERT INTO
  courses (title, description, course_provider, image)
VALUES
  (
    'C++ programming',
    'This course will teach you, how to write a sigma blazingly fast code',
    3,
    ''
  ),
  (
    'Дифференциальное исчисление для ПТУ',
    'Курс дифференциального исчисления для политехнических училищ',
    4,
    ''
  ),
  (
    'Дифференциальное исчисление для вузов',
    'Курс дифференциального исчисления для студентов вузов по техническим специальностям',
    4,
    ''
  ),
  (
    'Python with DataScience',
    'Этот курс научит вас самому востребованному языку программирования и самой высокооплачиваемой сфере использования',
    3,
    ''
  ),
  (
    'Психология для домохозяек',
    'Этот курс научит вас базовым знаниям по психологии, которые помогут вам распознать манипуляции, газлайтинг и т.д.',
    4,
    ''
  ),
  (
    'Ботаника для шестиклассников',
    'Этот курс научит вас базовым знаниям по ботанике для шестиклассников',
    4,
    ''
  ),
  (
    'Основы Linux',
    'Курс по основам операционной системы Linux, включающий установку, настройку и основные команды',
    3,
    ''
  ),
  (
    'Введение в AWS',
    'Основы работы с Amazon Web Services (AWS): создание и управление облачными ресурсами',
    3,
    ''
  ),
  (
    'Docker для начинающих',
    'Этот курс научит вас основам использования Docker для контейнеризации приложений',
    3,
    ''
  ),
  (
    'Математический анализ',
    'Курс по основам математического анализа для студентов технических специальностей',
    4,
    ''
  ),
  (
    'Базы данных с MySQL',
    'Изучение основ работы с реляционными базами данных на примере MySQL',
    3,
    ''
  ),
  (
    'Web-разработка с HTML и CSS',
    'Курс по созданию веб-страниц с использованием HTML и CSS, включая адаптивный дизайн',
    3,
    ''
  ),
  (
    'Основы кибербезопасности',
    'Введение в принципы кибербезопасности и защиты информации',
    3,
    ''
  ),
  (
    'Machine Learning с Python',
    'Изучение основ машинного обучения с использованием языка программирования Python',
    3,
    ''
  ),
  (
    'Проектирование баз данных',
    'Курс по проектированию и оптимизации баз данных для высоконагруженных систем',
    3,
    ''
  ),
  (
    'Алгоритмы и структуры данных',
    'Изучение основных алгоритмов и структур данных для эффективного решения задач программирования',
    4,
    ''
  ),
  (
    'Введение в искусственный интеллект',
    'Основы искусственного интеллекта и его применение в различных областях',
    3,
    ''
  ),
  (
    'Программирование на Java',
    'Курс по программированию на языке Java для начинающих',
    3,
    ''
  ),
  (
    'DevOps основы',
    'Введение в DevOps методологии и инструменты, такие как Jenkins и Kubernetes',
    3,
    ''
  ),
  (
    'Проектный менеджмент с использованием Agile',
    'Основы управления проектами с использованием методологии Agile',
    3,
    ''
  ),
  (
    'Мобильная разработка на Android',
    'Изучение основ разработки мобильных приложений для платформы Android',
    3,
    ''
  ),
  (
    'Квантовая механика для физиков',
    'Курс по основам квантовой механики для студентов физико-математических специальностей',
    4,
    ''
  ),
  (
    'Анализ данных с R',
    'Курс по анализу данных с использованием языка программирования R',
    3,
    ''
  ),
  (
    'Электроника для начинающих',
    'Изучение основ электроники и электротехники',
    4,
    ''
  ),
  (
    'Криптография и безопасность',
    'Основы криптографии и методов защиты информации',
    3,
    ''
  ),
  (
    'История искусств',
    'Курс по истории мирового искусства от древних времен до современности',
    4,
    ''
  ),
  (
    'Философия',
    'Введение в основные философские концепции и мысли от античности до наших дней',
    4,
    ''
  ),
  (
    'Антропология',
    'Курс по изучению культурного и биологического разнообразия человечества',
    4,
    ''
  ),
  (
    'Социология',
    'Введение в основные концепции и теории социологии, изучение социальных структур и процессов',
    4,
    ''
  ),
  (
    'Экономика',
    'Основы микро- и макроэкономики, изучение экономических моделей и принципов',
    4,
    ''
  ),
  (
    'Психология развития',
    'Курс по психологии развития, изучение психических процессов на разных стадиях жизни человека',
    4,
    ''
  ),
  (
    'Литература',
    'Изучение мировой литературы, анализ произведений и литературных направлений',
    4,
    ''
  ),
  (
    'Биология',
    'Основы биологии, изучение строения и функций живых организмов',
    4,
    ''
  ),
  (
    'Геология',
    'Введение в геологию, изучение строения Земли и геологических процессов',
    4,
    ''
  ),
  (
    'Экология',
    'Основы экологии, изучение взаимоотношений живых организмов с окружающей средой',
    4,
    ''
  ),
  (
    'Астрономия',
    'Изучение космоса, строения и эволюции небесных тел',
    4,
    ''
  ),
  (
    'Химия',
    'Основы химии, изучение химических реакций и свойств веществ',
    4,
    ''
  ),
  (
    'Физика',
    'Курс по основам физики, изучение законов природы и физических явлений',
    4,
    ''
  ),
  (
    'Лингвистика',
    'Введение в лингвистику, изучение языков и их структур',
    4,
    ''
  );


INSERT INTO
  course_categories (course_id, category_id)
VALUES
  (1, 1),  -- C++ programming -> Компьютерные Наука
  (2, 2),  -- Дифференциальное исчисление для ПТУ -> Математика
  (3, 2),  -- Дифференциальное исчисление для вузов -> Математика
  (4, 1),  -- Python with DataScience -> Компьютерные Наука
  (4, 2),  -- Python with DataScience -> Математика
  (5, 4),  -- Психология для домохозяек -> Психология
  (6, 3),  -- Ботаника для шестиклассников -> Биология
  (7, 1),  -- Основы Linux -> Компьютерные Наука
  (8, 6),  -- Введение в AWS -> AWS
  (9, 1),  -- Docker для начинающих -> Компьютерные Наука
  (10, 2), -- Математический анализ -> Математика
  (11, 1), -- Базы данных с MySQL -> Компьютерные Наука
  (12, 1), -- Web-разработка с HTML и CSS -> Компьютерные Наука
  (13, 1), -- Основы кибербезопасности -> Компьютерные Наука
  (14, 1), -- Machine Learning с Python -> Компьютерные Наука
  (14, 2), -- Machine Learning с Python -> Математика
  (15, 1), -- Проектирование баз данных -> Компьютерные Наука
  (16, 1), -- Алгоритмы и структуры данных -> Компьютерные Наука
  (16, 2), -- Алгоритмы и структуры данных -> Математика
  (17, 1), -- Введение в искусственный интеллект -> Компьютерные Наука
  (17, 2), -- Введение в искусственный интеллект -> Математика
  (18, 1), -- Программирование на Java -> Компьютерные Наука
  (19, 5), -- DevOps основы -> Девопс
  (20, 1), -- Проектный менеджмент с использованием Agile -> Компьютерные Наука
  (21, 1), -- Мобильная разработка на Android -> Компьютерные Наука
  (22, 8), -- Квантовая механика для физиков -> Математика
  (23, 2), -- Анализ данных с R -> Математика
  (24, 8), -- Электроника для начинающих -> Компьютерные Наука
  (25, 1), -- Криптография и безопасность -> Компьютерные Наука
  (25, 2), -- Криптография и безопасность -> Математика
  (26, 4), -- История искусств -> Психология
  (27, 4), -- Философия -> Психология
  (28, 4), -- Антропология -> Психология
  (29, 4), -- Социология -> Психология
  (30, 4), -- Экономика -> Психология
  (31, 4), -- Психология развития -> Психология
  (32, 4), -- Литература -> Психология
  (33, 3), -- Биология -> Биология
  (34, 9), -- Геология -> Биология
  (35, 3), -- Экология -> Биология
  (36, 8), -- Астрономия -> Биология
  (37, 3), -- Химия -> Биология
  (38, 8), -- Физика -> Биология
  (39, 4)  -- Лингвистика -> Психология
;


INSERT INTO
  course_teachers (course_id, user_id)
VALUES
  (1, 3), -- User 1 teach c++
  (2, 4) -- User 1 teach calculus
;